from enum import Enum
from core.mixins.max_length_choices_strings_mixin import MaxLengthChoicesStringsMixin

class CategoryTypesChoices(MaxLengthChoicesStringsMixin, Enum):
    РД = 'Ръководна дейност'
    УД = 'Учебна дейност'
    ФД = 'Факултетна дейност'
    ФДСИ = 'Факултетна дейност - "Сценични изкуства"'
    ФДЕИ = 'Факултетна дейност - "Екранни изкуства"'
    НИД = 'Научна и издателска дейност'
    ХТД = 'Художествено - творческа дейност'
    ХТД_УДТ = 'Худож. - творч. д-ност - Учебен драматичен театър'
    ХТД_УКТ = 'Худож. - творч. д-ност - Учебен куклен театър'
    ХТД_УАВК = 'Худож. - творч. д-ност - Учебен аудио визуален комплекс'
    МС = 'Международно сътрудничество'
    ПД = 'Проектна дейност'
    ФСД = 'Финансово  - счетоводна дейност'
    АПД = 'Административно - правна дейност'
    ЧР = 'Човешки ресурси'
    БТ = 'Безопасност на труда'
    КС = 'Капитално строителство'
    БД = 'Библиотечна дейност'
    СС = 'Студентски съвет'
